## Importing Pandas

Install pandas as pip install pandas

In [1]:
import pandas as pd

In [2]:
df= pd.read_csv("D:\DATA SCIENCE\iris.xls")
df

,Unnamed: 0,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species
0,1,5.1,3.5,1.4,0.2,setosa
1,2,4.9,3.0,1.4,0.2,setosa
2,3,4.7,3.2,1.3,0.2,setosa
3,4,4.6,3.1,1.5,0.2,setosa
4,5,5.0,3.6,1.4,0.2,setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,virginica
146,147,6.3,2.5,5.0,1.9,virginica
147,148,6.5,3.0,5.2,2.0,virginica
148,149,6.2,3.4,5.4,2.3,virginica
149,150,5.9,3.0,5.1,1.8,virginica

In [3]:
df.head() #first 5 records

   Unnamed: 0  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           1           5.1          3.5           1.4          0.2  setosa
1           2           4.9          3.0           1.4          0.2  setosa
2           3           4.7          3.2           1.3          0.2  setosa
3           4           4.6          3.1           1.5          0.2  setosa
4           5           5.0          3.6           1.4          0.2  setosa

In [4]:
df.tail() #last 5 records

,Unnamed: 0,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species
145,146,6.7,3.0,5.2,2.3,virginica
146,147,6.3,2.5,5.0,1.9,virginica
147,148,6.5,3.0,5.2,2.0,virginica
148,149,6.2,3.4,5.4,2.3,virginica
149,150,5.9,3.0,5.1,1.8,virginica

In [5]:
df.head(10) #number of records to fetch

   Unnamed: 0  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           1           5.1          3.5           1.4          0.2  setosa
1           2           4.9          3.0           1.4          0.2  setosa
2           3           4.7          3.2           1.3          0.2  setosa
3           4           4.6          3.1           1.5          0.2  setosa
4           5           5.0          3.6           1.4          0.2  setosa
5           6           5.4          3.9           1.7          0.4  setosa
6           7           4.6          3.4           1.4          0.3  setosa
7           8           5.0          3.4           1.5          0.2  setosa
8           9           4.4          2.9           1.4          0.2  setosa
9          10           4.9          3.1           1.5          0.1  setosa

In [6]:
df.tail(7)

,Unnamed: 0,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species
143,144,6.8,3.2,5.9,2.3,virginica
144,145,6.7,3.3,5.7,2.5,virginica
145,146,6.7,3.0,5.2,2.3,virginica
146,147,6.3,2.5,5.0,1.9,virginica
147,148,6.5,3.0,5.2,2.0,virginica
148,149,6.2,3.4,5.4,2.3,virginica
149,150,5.9,3.0,5.1,1.8,virginica

## Columns

In [7]:
df["Sepal.Width"] #fetching one column from the dataset

0      3.5
1      3.0
2      3.2
3      3.1
4      3.6
      ...
145    3.0
146    2.5
147    3.0
148    3.4
149    3.0
Name: Sepal.Width, Length: 150, dtype: float64

In [8]:
df[["Sepal.Width"]]

     Sepal.Width
0            3.5
1            3.0
2            3.2
3            3.1
4            3.6
..           ...
145          3.0
146          2.5
147          3.0
148          3.4
149          3.0

[150 rows x 1 columns]

In [9]:
df[["Sepal.Width","Sepal.Length"]]

     Sepal.Width  Sepal.Length
0            3.5           5.1
1            3.0           4.9
2            3.2           4.7
3            3.1           4.6
4            3.6           5.0
..           ...           ...
145          3.0           6.7
146          2.5           6.3
147          3.0           6.5
148          3.4           6.2
149          3.0           5.9

[150 rows x 2 columns]

## With Index Number

In [10]:
df["Sepal.Length"][1:4] #index number

1    4.9
2    4.7
3    4.6
Name: Sepal.Length, dtype: float64

In [11]:
df[1:5][["Sepal.Length","Sepal.Width","Species"]]

   Sepal.Length  Sepal.Width Species
1           4.9          3.0  setosa
2           4.7          3.2  setosa
3           4.6          3.1  setosa
4           5.0          3.6  setosa

## Datatype, The Measures of Central Tendency.

In [12]:
df.dtypes # datatypes of all columns

Unnamed: 0        int64
Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [13]:
df["Sepal.Length"].dtypes #datatype of one column

dtype('float64')

In [14]:
df["Sepal.Length"].mean() #mean of one column

5.843333333333335

In [15]:
df["Sepal.Length"].median() #mean of one column

5.8

In [16]:
df["Sepal.Length"].mode() #mean of one column

0    5.0
Name: Sepal.Length, dtype: float64

In [17]:
df["Sepal.Length"].max() #mean of one column

7.9

In [18]:
df["Sepal.Length"].min() #mean of one column

4.3

In [19]:
df.describe()

       Unnamed: 0  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count  150.000000    150.000000   150.000000    150.000000   150.000000
mean    75.500000      5.843333     3.057333      3.758000     1.199333
std     43.445368      0.828066     0.435866      1.765298     0.762238
min      1.000000      4.300000     2.000000      1.000000     0.100000
25%     38.250000      5.100000     2.800000      1.600000     0.300000
50%     75.500000      5.800000     3.000000      4.350000     1.300000
75%    112.750000      6.400000     3.300000      5.100000     1.800000
max    150.000000      7.900000     4.400000      6.900000     2.500000

In [20]:
df.shape

(150, 6)

In [21]:
df.size

900

## Creating a Dataframe

In [33]:
dataframe= {
    "students":["sam","shub","shweta","amruta","shivam","raj"],
    "gender":['female','male','female','female','male','male'],
    "age":[23,27,28,27,24,30],
    "course":["sql","powerbi","tableau","powerbi","python","python"],
    "date":['1-2-2022','1-5-2022','1-7-2022','1-2-2022','1-4-2022','1-8-2022']
    }

In [34]:
std = pd.DataFrame(dataframe)
std

  students  gender  age   course      date
0      sam  female   23      sql  1-2-2022
1     shub    male   27  powerbi  1-5-2022
2   shweta  female   28  tableau  1-7-2022
3   amruta  female   27  powerbi  1-2-2022
4   shivam    male   24   python  1-4-2022
5      raj    male   30   python  1-8-2022

## Selecting Rows Based on Conditions

In [35]:
std['gender']=='female'

0     True
1    False
2     True
3     True
4    False
5    False
Name: gender, dtype: bool

In [36]:
std[std['gender']=='female']

  students  gender  age   course      date
0      sam  female   23      sql  1-2-2022
2   shweta  female   28  tableau  1-7-2022
3   amruta  female   27  powerbi  1-2-2022

In [37]:
std[std['course'] == 'python']

  students gender  age  course      date
4   shivam   male   24  python  1-4-2022
5      raj   male   30  python  1-8-2022

In [38]:
std[std['age'] <25]

  students  gender  age  course      date
0      sam  female   23     sql  1-2-2022
4   shivam    male   24  python  1-4-2022

In [39]:
std[std['age'] >=27]

  students  gender  age   course      date
1     shub    male   27  powerbi  1-5-2022
2   shweta  female   28  tableau  1-7-2022
3   amruta  female   27  powerbi  1-2-2022
5      raj    male   30   python  1-8-2022

In [40]:
std[std['age'] == 30]

  students gender  age  course      date
5      raj   male   30  python  1-8-2022

In [41]:
std[std['date'] == '1-2-2022']

  students  gender  age   course      date
0      sam  female   23      sql  1-2-2022
3   amruta  female   27  powerbi  1-2-2022

In [42]:
std[std['date'] > '1-2-2022']

  students  gender  age   course      date
1     shub    male   27  powerbi  1-5-2022
2   shweta  female   28  tableau  1-7-2022
4   shivam    male   24   python  1-4-2022
5      raj    male   30   python  1-8-2022